### OpenTofu `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # module.artifact-registry.google_artifact_registry_repository.docker-repo will be created
+   resource "google_artifact_registry_repository" "docker-repo" {
+       create_time      = (known after apply)
+       description      = "main docker registry for apps in the resumejson staging project"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       format           = "DOCKER"
+       id               = (known after apply)
+       location         = "us-central1"
+       mode             = "STANDARD_REPOSITORY"
+       name             = (known after apply)
+       project          = "resumejson-staging"
+       repository_id    = "resumejson-staging"
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       update_time      = (known after apply)
    }

  # module.cloud-storage.google_storage_bucket.bucket will be created
+   resource "google_storage_bucket" "bucket" {
+       effective_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
+       force_destroy               = false
+       id                          = (known after apply)
+       location                    = "US-CENTRAL1"
+       name                        = "error-reports"
+       project                     = (known after apply)
+       project_number              = (known after apply)
+       public_access_prevention    = (known after apply)
+       rpo                         = (known after apply)
+       self_link                   = (known after apply)
+       storage_class               = "STANDARD"
+       terraform_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
+       uniform_bucket_level_access = (known after apply)
+       url                         = (known after apply)

+       versioning {
+           enabled = true
        }
    }

  # module.firestore.google_firestore_database.firestore_database will be created
+   resource "google_firestore_database" "firestore_database" {
+       app_engine_integration_mode       = (known after apply)
+       concurrency_mode                  = (known after apply)
+       create_time                       = (known after apply)
+       delete_protection_state           = (known after apply)
+       deletion_policy                   = "DELETE"
+       earliest_version_time             = (known after apply)
+       etag                              = (known after apply)
+       id                                = (known after apply)
+       key_prefix                        = (known after apply)
+       location_id                       = "nam5"
+       name                              = "(default)"
+       point_in_time_recovery_enablement = "POINT_IN_TIME_RECOVERY_DISABLED"
+       project                           = "resumejson-staging"
+       type                              = "FIRESTORE_NATIVE"
+       uid                               = (known after apply)
+       update_time                       = (known after apply)
+       version_retention_period          = (known after apply)
    }

  # module.project_apis.google_project_service.project_apis[7] will be created
+   resource "google_project_service" "project_apis" {
+       disable_on_destroy = true
+       id                 = (known after apply)
+       project            = "resumejson-staging"
+       service            = "secretmanager.googleapis.com"
    }

  # module.service-accounts[0].google_project_iam_member.service_account_roles[0] will be created
+   resource "google_project_iam_member" "service_account_roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:frontend-service@resumejson-staging.iam.gserviceaccount.com"
+       project = "resumejson-staging"
+       role    = "roles/file.editor"
    }

  # module.service-accounts[0].google_project_iam_member.service_account_roles[1] will be created
+   resource "google_project_iam_member" "service_account_roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:frontend-service@resumejson-staging.iam.gserviceaccount.com"
+       project = "resumejson-staging"
+       role    = "roles/secretmanager.secretAccessor"
    }

  # module.service-accounts[0].google_project_iam_member.service_account_roles[2] will be created
+   resource "google_project_iam_member" "service_account_roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:frontend-service@resumejson-staging.iam.gserviceaccount.com"
+       project = "resumejson-staging"
+       role    = "roles/firebaseauth.viewer"
    }

  # module.service-accounts[0].google_service_account.service_account will be created
+   resource "google_service_account" "service_account" {
+       account_id   = "frontend-service"
+       disabled     = false
+       display_name = "Service account for frontend-service"
+       email        = "frontend-service@resumejson-staging.iam.gserviceaccount.com"
+       id           = (known after apply)
+       member       = "serviceAccount:frontend-service@resumejson-staging.iam.gserviceaccount.com"
+       name         = (known after apply)
+       project      = "resumejson-staging"
+       unique_id    = (known after apply)
    }

  # module.service-accounts[1].google_project_iam_member.service_account_roles[0] will be created
+   resource "google_project_iam_member" "service_account_roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:github-actions-ci@resumejson-staging.iam.gserviceaccount.com"
+       project = "resumejson-staging"
+       role    = "roles/run.admin"
    }

  # module.service-accounts[1].google_project_iam_member.service_account_roles[1] will be created
+   resource "google_project_iam_member" "service_account_roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:github-actions-ci@resumejson-staging.iam.gserviceaccount.com"
+       project = "resumejson-staging"
+       role    = "roles/secretmanager.secretAccessor"
    }

  # module.service-accounts[1].google_project_iam_member.service_account_roles[2] will be created
+   resource "google_project_iam_member" "service_account_roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:github-actions-ci@resumejson-staging.iam.gserviceaccount.com"
+       project = "resumejson-staging"
+       role    = "roles/iam.serviceAccountUser"
    }

  # module.service-accounts[1].google_project_iam_member.service_account_roles[3] will be created
+   resource "google_project_iam_member" "service_account_roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:github-actions-ci@resumejson-staging.iam.gserviceaccount.com"
+       project = "resumejson-staging"
+       role    = "roles/artifactregistry.writer"
    }

  # module.service-accounts[1].google_project_iam_member.service_account_roles[4] will be created
+   resource "google_project_iam_member" "service_account_roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:github-actions-ci@resumejson-staging.iam.gserviceaccount.com"
+       project = "resumejson-staging"
+       role    = "roles/artifactregistry.reader"
    }

  # module.service-accounts[1].google_service_account.service_account will be created
+   resource "google_service_account" "service_account" {
+       account_id   = "github-actions-ci"
+       disabled     = false
+       display_name = "Service account for github-actions-ci"
+       email        = "github-actions-ci@resumejson-staging.iam.gserviceaccount.com"
+       id           = (known after apply)
+       member       = "serviceAccount:github-actions-ci@resumejson-staging.iam.gserviceaccount.com"
+       name         = (known after apply)
+       project      = "resumejson-staging"
+       unique_id    = (known after apply)
    }

  # module.service-accounts[2].google_project_iam_member.service_account_roles[0] will be created
+   resource "google_project_iam_member" "service_account_roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:main-server@resumejson-staging.iam.gserviceaccount.com"
+       project = "resumejson-staging"
+       role    = "roles/file.editor"
    }

  # module.service-accounts[2].google_project_iam_member.service_account_roles[1] will be created
+   resource "google_project_iam_member" "service_account_roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:main-server@resumejson-staging.iam.gserviceaccount.com"
+       project = "resumejson-staging"
+       role    = "roles/secretmanager.secretAccessor"
    }

  # module.service-accounts[2].google_project_iam_member.service_account_roles[2] will be created
+   resource "google_project_iam_member" "service_account_roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:main-server@resumejson-staging.iam.gserviceaccount.com"
+       project = "resumejson-staging"
+       role    = "roles/firebaseauth.viewer"
    }

  # module.service-accounts[2].google_service_account.service_account will be created
+   resource "google_service_account" "service_account" {
+       account_id   = "main-server"
+       disabled     = false
+       display_name = "Service account for main-server"
+       email        = "main-server@resumejson-staging.iam.gserviceaccount.com"
+       id           = (known after apply)
+       member       = "serviceAccount:main-server@resumejson-staging.iam.gserviceaccount.com"
+       name         = (known after apply)
+       project      = "resumejson-staging"
+       unique_id    = (known after apply)
    }

  # module.service-accounts[3].google_project_iam_member.service_account_roles[0] will be created
+   resource "google_project_iam_member" "service_account_roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:lambda-updater@resumejson-staging.iam.gserviceaccount.com"
+       project = "resumejson-staging"
+       role    = "roles/file.editor"
    }

  # module.service-accounts[3].google_project_iam_member.service_account_roles[1] will be created
+   resource "google_project_iam_member" "service_account_roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:lambda-updater@resumejson-staging.iam.gserviceaccount.com"
+       project = "resumejson-staging"
+       role    = "roles/secretmanager.secretAccessor"
    }

  # module.service-accounts[3].google_service_account.service_account will be created
+   resource "google_service_account" "service_account" {
+       account_id   = "lambda-updater"
+       disabled     = false
+       display_name = "Service account for lambda-updater"
+       email        = "lambda-updater@resumejson-staging.iam.gserviceaccount.com"
+       id           = (known after apply)
+       member       = "serviceAccount:lambda-updater@resumejson-staging.iam.gserviceaccount.com"
+       name         = (known after apply)
+       project      = "resumejson-staging"
+       unique_id    = (known after apply)
    }

  # module.service-accounts[4].google_project_iam_member.service_account_roles[0] will be created
+   resource "google_project_iam_member" "service_account_roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:test-reporter@resumejson-staging.iam.gserviceaccount.com"
+       project = "resumejson-staging"
+       role    = "roles/storage.objectViewer"
    }

  # module.service-accounts[4].google_service_account.service_account will be created
+   resource "google_service_account" "service_account" {
+       account_id   = "test-reporter"
+       disabled     = false
+       display_name = "Service account for test-reporter"
+       email        = "test-reporter@resumejson-staging.iam.gserviceaccount.com"
+       id           = (known after apply)
+       member       = "serviceAccount:test-reporter@resumejson-staging.iam.gserviceaccount.com"
+       name         = (known after apply)
+       project      = "resumejson-staging"
+       unique_id    = (known after apply)
    }

Plan: 23 to add, 0 to change, 0 to destroy.
```
</details>